is52038b-labs/02/README.tex
% Created 2019-09-17 Tue 14:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fontspec}
\setmainfont[Mapping=tex-text]{Libertinus Serif}\setsansfont[Mapping=tex-text]{Libertinus Sans}
\usepackage{unicode-math}
\setmathfont{Libertinus Math}
\usepackage[margin=1in]{geometry}
\usepackage{algpseudocode}
\algnewcommand\algorithmicbreak{\textbf{break}}
\algnewcommand\Break{\algorithmicbreak{} }%
\algnewcommand\algorithmiccontinue{\textbf{continue}}
\algnewcommand\Continue{\algorithmiccontinue{} }%
\MakeRobust{\Call}
\date{}
\title{Algorithms \& Data Structures: Lab 02\\\medskip
\large week of 8th October 2018}
\hypersetup{
 pdfauthor={lewis jones},
 pdftitle={Algorithms \& Data Structures: Lab 02},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.2.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
This week's lab includes an assessment, available from the module
\href{https://learn.gold.ac.uk/course/view.php?id=11491}{learn.gold page}, which is open only during this week.  Aim
to \href{https://learn.gold.ac.uk/mod/lti/view.php?id=605172}{submit} before the end of the session!

\section{Setup}
\label{sec:org0100ffd}
\subsection{Saving your work}
\label{sec:org17329d4}
You might by now have used \texttt{git} to download the lab bundle, to
test your setup on your own computer.  (If you haven't, but are
planning to work on lab computers, you will nevertheless need to
understand this section in order to save your work in future.)  You
might have made changes to your copy, and at this point you should
save those changes.  First, examine your copy to see if there are
any changes; run these commands from the labs directory:
\begin{verbatim}
git status
git diff
\end{verbatim}
The first command will summarize files that have changed in the
directory relative to the pristine copies; the second will show you
the details of the changes.  If you are satisfied that you want to
keep the changes, store them in your local version control system
by doing
\begin{verbatim}
git commit -a
\end{verbatim}
and writing a suitable commit message.  (If you have no changes,
you don't need to do this)
\subsection{Downloading this week's distribution}
\label{sec:org2cb99aa}
Once you have successfully saved your changes from last week, if
any, you can get my updates by doing
\begin{verbatim}
git pull
\end{verbatim}
which \emph{should} automatically merge in new content.  After the \texttt{git
   pull} command, you should have a new directory containing this
week's material (named \texttt{02/}) alongside the existing \texttt{00/} and
\texttt{01/} directories.

Alternatively, you can make a fresh download of everything, for
example to a different computer, using
\begin{verbatim}
git clone http://gitlab.doc.gold.ac.uk/crhodes/is52038b-labs.git
\end{verbatim}
which will check out the lab bundle to a directory called
\texttt{is52038b-labs} under your current working directory.
\clearpage
\section{Pseudocode exercises}
\label{sec:orge6522a7}
\subsection{Exercise 1}
\label{sec:orgfc23fbd}
Consider the following pseudocode, defining a function \textsc{Exercise1}:
\begin{algorithmic}[1]
  \Function{Exercise1}{v}
  \State{a ← 0; b ← 0}
  \For{0 ≤ i < \Call{length}{v}}
  \If{v[i] > b}
  \If{v[i] > a}
  \State{b ← a}
  \State{a ← v[i]}
  \Else
  \State{b ← v[i]}
  \EndIf
  \EndIf
  \EndFor
  \State \Return b
  \EndFunction
\end{algorithmic}
Run \textsc{Exercise1} (recording the states of the program on
paper or in a text editor) on the following inputs:
\begin{itemize}
\item the vector \{5,2,0,3,8\}
\item the vector made up of your birth date (\emph{e.g.} \{1,9,7,8,1,2,2,5\})
\end{itemize}

\noindent Exchange your answers with your neighbour, and discuss:
\begin{enumerate}
\item what do you think this pseudocode does?
\item can you prove it?
\item in terms of the length of v, how many times does line 4 get
executed?  What about line 6?
\end{enumerate}
\clearpage
\subsection{Exercise 2}
\label{sec:org8da2c20}
Consider the following pseudocode, defining a function
\textsc{Exercise2}:
\begin{algorithmic}[1]
  \Function{Exercise2}{v}
  \For{0 < i < \Call{length}{v}}
  \State{current ← v[i]}
  \State{j ← i - 1}
  \While{j ≥ 0}
  \If{v[j] ≤ current}
  \State \Break
  \EndIf
  \State{v[j+1] ← v[j]}
  \State{j ← j - 1}
  \EndWhile
  \State{v[j+1] ← current}
  \EndFor
  \State \Return v
  \EndFunction
\end{algorithmic}
Run \textsc{Exercise2} (recording the states of the program on
paper or in a text editor) on the following inputs:
\begin{itemize}
\item the vector \{5,2,0,3,8\}
\item the vector made up of the digits of your birth year (\emph{e.g.} \{1,9,7,8\})
\end{itemize}

\noindent Exchange your answers with your neighbour, and discuss:
\begin{enumerate}
\item what do you think this pseudocode does?
\item can you prove it?
\item in terms of the length of v, how many times does line 4 get
executed?  What about line 6?
\end{enumerate}
\section{Hello, world}
\label{sec:orgf25097a}
Your lab bundle should contain a directory named \texttt{02}, with
subdirectories \texttt{cpp} and \texttt{java} for C++ and Java respectively.  Your
task for this part of the lab is to implement two methods:

\begin{enumerate}
\item \texttt{studentNumber()}, which should return your student number (as an
integer)
\item \texttt{moodleID()}, which should return your Moodle ID number, which
you can find by clicking on your name in the footer of every
learn.gold page while you are logged in and looking at (and
expanding if necessary) the URL bar of your browser.
\end{enumerate}

Check that you can compile your modified code by running \texttt{make} in
the appropriate directory.  The test cases provided with the lab
bundle (that you can run using \texttt{make test}) do not check that you
have correctly identified these numbers for yourself: only that they
are plausible.
\section{Uploading your work}
\label{sec:org790cb0a}
Before the end of the session, you must submit your work to the
\href{https://learn.gold.ac.uk/mod/lti/view.php?id=605172}{online submission system}.  Access to the online submission will be
closed at \textbf{16:00} on \textbf{Friday 12th October}.  You may submit more
than once, and your best score will be kept: do not wait until the
very end of the week to submit.
\end{document}
